org-content/ecology.org
#+hugo_base_dir: ../
#+hugo_section: ecology
* Chapter 3
:PROPERTIES:
:EXPORT_HUGO_SECTION*: ch-3
:EXPORT_FILE_NAME: _index
:END:
** Adaptation to environmental factors
+ Change factors that limit growth (amount of food, composition of air)
+ Change Tolerance Range (Temperature tolerance, ph tolerance )
+ Change Behavior to adapt beyond Range ( avoid cold areas )
** Limiting environmental factors
+ physical factors (strength, ability to fly)
+ Physical resources
+ Tolerance bounds
** optimality and =Principle of allocation=
Adaptation to one challenge may decrease for another. The more an organism adapts to a stable environment (optimality), the less able it is to adapt to new environments that pose new challenges (moving from hot to cold, fresh water to salt water or vice versa)
+ Large beaks make it easier to break large nuts, but harder to eat insects out of trees.
+ Homeostasis allows humans to survive in a variety of environmental conditions, but requires more (is limited by) food.
** Normal Distribution and measures of variation
Many biological factors rely on modifications to the normal distribution.
+ quantified as a probability or confidence interval (95% of samples fall within this range of values)
+ \(\text{Sample Variance} = \frac{\sum_1^n (\bar x - x_i)^2}{n-1} = s^2\)
+ \(\text{Sample Mean} = \frac{\sum_1^n}{n} = \bar x\)
+ \(\text{confidence statistic (percentage)} = 1-\alpha\)
+ \(\text{confidence interval} = \bar x \pm t_{1-\alpha} * s/\sqrt n\)
+ \(\text{Standard Error (Estimate of the mean)} = \frac{s^2}{n}\)
*** Description of the plots used in ecology
+ y axis refers to the frequency of individuals (higher is more)
+ x axis refers to some limiting factor (food, temperature)
+ Peak refers to the mean of the sample
*** P Value
The P value is the probability that the Null hypothesis is true. This value is calculated with a statistical test (t test when using a sample).
**** Example
+ \(H_0 = \text{Cancer is randomly occuring}\)
+ \(H_a = \text{Cancer is caused by radiation damage}\)
+ \(P < 0.05\)
+ There is less than a 5 percent chance that cancer is randomly occurring.
